{
  "cse-190": {
    "course-name": "Current Topics in Computer Science and Engineering",
    "credits": 2,
    "quarter": "AU19",
    "description": "CSE DA Seminar"
  },
  "gen-st-199": {
    "course-name": "The University Community",
    "credits": 2,
    "quarter": "AU19",
    "description": "Introduces students to various aspects of the University of Washington community. Includes exploration of university resources and opportunities, and academically related skill development."
  },
  "cse-142": {
    "course-name": "Computer Programming I",
    "credits": 4,
    "quarter": "AU19",
    "description": "Basic programming-in-the-small abilities and concepts including procedural programming (methods, parameters, return, values), basic control structures (sequence, if/else, for loop, while loop), file processing, arrays, and an introduction to defining objects. Intended for students without prior programming experience."
  },
  "math-124": {
    "course-name": "Calculus With Analytic Geometry I",
    "credits": 5,
    "quarter": "AU19",
    "description": "First quarter in calculus of functions of a single variable. Emphasizes differential calculus. Emphasizes applications and problem solving using the tools of calculus."
  },
  "art-190": {
    "course-name": "Introduction to Drawing",
    "credits": 5,
    "quarter": "WI20",
    "description": "Builds basic drawing skills, develops understanding of primary concepts which relate to drawing and develops an understanding of the grammar or syntax of two-dimensional language. Students move beyond their current knowledge and abilities and link new skills, concepts, and understandings to creative expressing."
  },
  "math-125": {
    "course-name": "Calculus With Analytic Geometry II",
    "credits": 5,
    "quarter": "WI20",
    "description": "Second quarter in the calculus of functions of a single variable. Emphasizes integral calculus. Emphasizes applications and problem solving using the tools of calculus."
  },
  "cse-143": {
    "course-name": "Computer Programming II",
    "credits": 5,
    "quarter": "WI20",
    "description": "Continuation of CSE 142. Concepts of data abstraction and encapsulation including stacks, queues, linked lists, binary trees, recursion, instruction to complexity and use of predefined collection classes."
  },
  "eng-111": {
    "course-name": "Composition: Literature",
    "credits": 5,
    "quarter": "SP20",
    "description": "Study and practice of good writing; topics derived from reading and discussing stories, poems, essays, and plays."
  },
  "math-126": {
    "course-name": "Calculus With Analytic Geometry III",
    "credits": 5,
    "quarter": "SP20",
    "description": "Third quarter in calculus sequence. Introduction to Taylor polynomials and Taylor series, vector geometry in three dimensions, introduction to multivariable differential calculus, double integrals in Cartesian and polar coordinates."
  },
  "phys-121": {
    "course-name": "Mechanics",
    "credits": 5,
    "quarter": "SP20",
    "description": "Basic principles of mechanics and experiments in mechanics for physical science and engineering majors."
  },
  "math-308": {
    "course-name": "Matrix Algebra With Applications",
    "credits": 3,
    "quarter": "AU20",
    "description": "Systems of linear equations, vector spaces, matrices, subspaces, orthogonality, least squares, eigenvalues, eigenvectors, applications. For students in engineering, mathematics, and the sciences."
  },
  "cse-390": {
    "course-name": "Special Topics In Computer Science And Engineering",
    "credits": 1,
    "quarter": "AU20",
    "description": "Covers topics of current interest in computer science and engineering."
  },
  "psych-210": {
    "course-name": "The Diversity Of Human Sexuality",
    "credits": 5,
    "quarter": "AU20",
    "description": "Considers biological, psychological, and socio-cultural determinants of human sexuality and sexual behavior, and how their interaction leads to diverse expressions of sexuality, sexual bonding, gender orientation, reproductive strategies, and physical and psychological sexual development."
  },
  "cse-311": {
    "course-name": "Foundations Of Computing I",
    "credits": 4,
    "quarter": "AU20",
    "description": "Examines fundamentals of logic, set theory, induction, and algebraic structures with applications to computing; finite state machines; and limits of computability."
  },
  "cse-351": {
    "course-name": "The Hardware/Software Interface",
    "credits": 4,
    "quarter": "WI21",
    "description": "Examines key computational abstraction levels below modern high-level languages; number representation, assembly language, introduction to C, memory management, the operating-system process model, high-level machine architecture including the memory hierarchy, and how high-level languages are implemented."
  },
  "cse-332": {
    "course-name": "Data Structures And Parallelism",
    "credits": 4,
    "quarter": "WI21",
    "description": "Covers abstract data types and structures including dictionaries, balanced trees, hash tables, priority queues, and graphs; sorting; asymptotic analysis; fundamental graph algorithms including graph search, shortest path, and minimum spanning trees; multithreading and parallel algorithms; P and NP complexity classes."
  },
  "ling-200": {
    "course-name": "Introduction to Linguistics",
    "credits": 5,
    "quarter": "WI21",
    "description": "Language as the fundamental characteristic of the human species; diversity and complexity of human languages; phonological and grammatical analysis; dimensions of language use; and language acquisition and historical language change."
  },
  "cse-312": {
    "course-name": "Foundations Of Computing II",
    "credits": 4,
    "quarter": "SP21",
    "description": "Examines fundamentals of enumeration and discrete probability; applications of randomness to computing; polynomial-time versus NP; and NP-completeness."
  },
  "phil-100": {
    "course-name": "Introduction To Philosophy",
    "credits": 5,
    "quarter": "SP21",
    "description": "Major philosophical questions relating to such matters as the existence of God, the foundations of knowledge, the nature of reality, and the nature of morality. Approach may be either historical or topical."
  },
  "cse-331": {
    "course-name": "Software Design And Implementation",
    "credits": 4,
    "quarter": "SP21",
    "description": "Explores concepts and techniques for design and construction of reliable and maintainable software systems in modern high-level languages: specifications; program structure and design; program-correctness approaches, including testing; and event-driven programming (e.g., graphical user interface)."
  },
  "chem-142": {
    "course-name": "General Chemistry",
    "credits": 5,
    "quarter": "AU21",
    "description": "For science and engineering majors. Atomic nature of matter, quantum mechanics, ionic and covalent bonding, molecular geometry, stoichiometry, solution stoichiometry, kinetics, and gas laws."
  },
  "arch-150": {
    "course-name": "Appreciation Of Architecture I",
    "credits": 3,
    "quarter": "AU21",
    "description": "Historical survey of global architecture and built environments with reference to environmental, technological, and socio-cultural contexts, from prehistory to 1400."
  },
  "cse-341": {
    "course-name": "Programming Languages",
    "credits": 4,
    "quarter": "AU21",
    "description": "Basic concepts of programming languages, including abstraction mechanisms, static and dynamic typing, scope, syntax vs. semantics, first-class function closures, and algebraic datatypes. Detailed study of functional programming and other paradigms."
  },
  "cse-473": {
    "course-name": "Introduction To Artificial Intelligence",
    "credits": 3,
    "quarter": "AU21",
    "description": "Principal ideas and developments in artificial intelligence: Problem solving and search, game playing, knowledge representation and reasoning, uncertainty, machine learning, natural language processing."
  },
  "clas-101": {
    "course-name": "Latin And Greek In Current Use",
    "credits": 2,
    "quarter": "WI22",
    "description": "Designed to improve and increase English vocabulary through a study of the Latin and Greek elements in English, with emphasis on words in current literary and scientific use. Knowledge of Latin or Greek is not required."
  },
  "cse-333": {
    "course-name": "Systems Programming",
    "credits": 4,
    "quarter": "WI22",
    "description": "Includes substantial programming experience in languages that expose machine characteristics and low-level data representation (e.g., C and C++); explicit memory management; modern libraries and language features; interacting with operating-system services; introduction to concurrent programming."
  },
  "cms-272": {
    "course-name": "Perspectives On Film: Genre",
    "credits": 5,
    "quarter": "WI22",
    "description": "Introduction to study of film and/or television genre. Literary, mythic, and historic aspects of film and/or television genre."
  },
  "cse-344": {
    "course-name": "Introduction To Data Management",
    "credits": 4,
    "quarter": "WI22",
    "description": "Introduces database management systems and writing applications that use such systems; data models (e.g., relational, semi-structured), query languages (e.g., SQL, XQuery), language bindings, conceptual modeling, transactions, security, database tuning, data warehousing, parallelism, and web-data management."
  },
  "cse-163": {
    "course-name": "Intermediate Data Programming",
    "credits": 4,
    "quarter": "SP22",
    "description": "Intermediate data programming. Topics include writing programs that manipulate different types of data; leveraging the growing ecosystem of tools and libraries for data programming; writing programs that are both efficient and elegant; and writing medium-scale programs (100 to 200 lines)."
  },
  "cse-391": {
    "course-name": "System And Software Tools",
    "credits": 1,
    "quarter": "SP22",
    "description": "Introduction to tools commonly used in software development. Topics include using a command-line interface, writing scripts for file and string manipulation, managing user permissions, manipulating text with regular expressions, using build-management tools, and using version-control systems."
  },
  "cse-492-j": {
    "course-name": "Undergraduate Seminar",
    "credits": 1,
    "quarter": "SP22",
    "description": "Career Seminar."
  },
  "soc-225": {
    "course-name": "Data And Society",
    "credits": 3,
    "quarter": "SP22",
    "description": "Social implications of the digital revolution, including ethical issues associated with algorithmic design and privacy. Discusses data science as a new occupation that uses data to understand or influence people's behavior. Students will use a sociological lens to explore how our increasingly digital lifestyle changes institutions and social relations."
  },
  "cse-421": {
    "course-name": "Introduction To Algorithms",
    "credits": 3,
    "quarter": "SP22",
    "description": "Techniques for design of efficient algorithms. Methods for showing lower bounds on computational complexity. Particular algorithms for sorting, searching, set manipulation, arithmetic, graph problems, pattern matching."
  },
  "engl-288": {
    "course-name": "Introduction To Professional And Technical Writing",
    "credits": 5,
    "quarter": "AU22",
    "description": "Engages in professional genres and communication practices in light of emerging technologies. Students produce texts that prepare them to enter professional spaces."
  },
  "cse-442": {
    "course-name": "Data Visualization",
    "credits": 4,
    "quarter": "AU22",
    "description": "Techniques for creating effective visualizations of data based on principles from graphic design, perceptual psychology, and statistics. Topics include visual encoding models, exploratory data analysis, visualization software, interaction techniques, graphical perception, color, animation, high-dimensional data, cartography, network visualization, and text visualization."
  },
  "cse-484": {
    "course-name": "Computer Security",
    "credits": 4,
    "quarter": "AU22",
    "description": "Foundations of modern computer security, including software security, operating system security, network security, applied cryptography, human factors, authentication, anonymity, and web security."
  },
  "music-162": {
    "course-name": "American Popular Song",
    "credits": 5,
    "quarter": "WI23",
    "description": "Historical, social, and stylistic study of popular idioms from the late nineteenth century to the present. Most attention to contemporary idioms (rock, country-western, soul, hip-hop). Various facets of the industry examined to learn how they influence taste and musical style."
  },
  "cse-480": {
    "course-name": "Computer Ethics Seminar",
    "credits": 2,
    "quarter": "WI23",
    "description": "Reading and discussion seminar on the ethical issues surrounding sociotechnical systems and their impacts on society. Includes historical perspectives and current topics. Relates computer technology to ethical questions of power, politics, equity, privacy, autonomy, and more."
  },
  "cse-440": {
    "course-name": "Introduction To HCI: User Interface Design, Prototyping, And Evaluation",
    "credits": 5,
    "quarter": "WI23",
    "description": "Human-Computer Interaction (HCI) theory and techniques. Methods for designing, prototyping, and evaluating user interfaces to computing applications. Human capabilities, interface technology, interface design methods, and interface evaluation tools and techniques."
  },
  "cse-403": {
    "course-name": "Software Engineering",
    "credits": 4,
    "quarter": "WI23",
    "description": "Fundamentals of software engineering using a group project as the basic vehicle. Topics covered include the software crisis, managing complexity, requirements specification, architectural and detailed design, testing and analysis, software process, and tools and environments."
  },
  "cse-154": {
    "course-name": "Web Programming",
    "credits": 5,
    "quarter": "SP23",
    "description": "Covers languages, tools, and techniques for developing interactive and dynamic web pages. Topics include page styling, design, and layout; client and server side scripting; web security; and interacting with data sources such as databases."
  },
  "cse-492-d": {
    "course-name": "Deconstructing Cultural Norms in Computer Science",
    "credits": 1,
    "quarter": "SP23",
    "description": "In this course, we'll look at some norms in society broadly and how they reinforce systems of oppression, then lower into computing spaces and computer science to examine the norms within computer science learning spaces (for instance, the Allen School) and beyond."
  },
  "cse-492-c": {
    "course-name": "Navigating a Career in the Software Industry",
    "credits": 1,
    "quarter": "SP23",
    "description": "My goal for this seminar is to prepare all of you to enter the workforce with the information that most new grads acquire by trial and error (and to save you the error). This course is intended to be specific to computer science because the best use of your time is to provide information that is specific to the exact career you will enter."
  },
  "cse-481": {
    "course-name": "Networks and Mobile Systems Capstone",
    "credits": 5,
    "quarter": "SP23",
    "description": "Create cool and interesting projects where you get to use various mobile systems and networking technologies. The capstone will include background material on Android programming, networking as well as how various sensors like GPS, IMU, acoustic work to enable tracking, localization, augmented reality and ranging applications. "
  }
}